src/Request_teste2.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:est="http://servicos.saude.gov.br/cnes/v1r0/estabelecimentosaudeservice" xmlns:fil="http://servicos.saude.gov.br/wsdl/mensageria/v1r0/filtrolocalizacaoestabelecimentosaude" xmlns:loc="http://servicos.saude.gov.br/schema/cnes/v1r0/localizacao" xmlns:tip="http://servicos.saude.gov.br/schema/cnes/v1r0/tipounidade" xmlns:pag="http://servicos.saude.gov.br/wsdl/mensageria/v1r0/paginacao" xmlns:ch1="http://soap.acme.com/2.0/soap-common-types" xmlns:cmn="http://soap.acme.com/2.0/soap-common-types"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Timestamp wsu:Id="Timestamp-2018-09-16T18:27:31.430Z"><wsu:Created>2018-09-16T18:27:31.430Z</wsu:Created><wsu:Expires>2018-09-16T18:37:31.430Z</wsu:Expires></wsu:Timestamp><wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-2018-09-16T18:27:31.430Z"><wsse:Username>CNES.PUBLICO</wsse:Username><wsse:Password>cnes#2015public</wsse:Password></wsse:UsernameToken></wsse:Security></soap:Header><soap:Body xmlns:soap="http://soap.acme.com/2.0/soap-access-services" xmlns:cmn="http://soap.acme.com/2.0/soap-common-types"><est:requestLocalizarEstabelecimentoSaude><fil:FiltroLocalizacaoEstabelecimentoSaude><loc:Localizacao><loc:longitude>-43.179916</loc:longitude><loc:latitude>-22.901879</loc:latitude></loc:Localizacao><tip:tipoUnidade><tip:codigo>undefined</tip:codigo><tip:descricao>undefined</tip:descricao></tip:tipoUnidade><pag:Paginacao><pag:posicaoRegistroInicio>1</pag:posicaoRegistroInicio><pag:quantidadeRegistrosPorPagina>10</pag:quantidadeRegistrosPorPagina></pag:Paginacao></fil:FiltroLocalizacaoEstabelecimentoSaude></est:requestLocalizarEstabelecimentoSaude></soap:Body></soap:Envelope>