src/main/resources/EstabelecimentoSaudeService_localizacao.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:est="http://servicos.saude.gov.br/cnes/v1r0/estabelecimentosaudeservice" xmlns:fil="http://servicos.saude.gov.br/wsdl/mensageria/v1r0/filtrolocalizacaoestabelecimentosaude" xmlns:loc="http://servicos.saude.gov.br/schema/cnes/v1r0/localizacao" xmlns:tip="http://servicos.saude.gov.br/schema/cnes/v1r0/tipounidade" xmlns:pag="http://servicos.saude.gov.br/wsdl/mensageria/v1r0/paginacao">
   <soap:Header/>
   <soap:Body>
      <est:requestLocalizarEstabelecimentoSaude>
         <fil:FiltroLocalizacaoEstabelecimentoSaude>
            <loc:Localizacao>
               <loc:longitude>?</loc:longitude>
               <loc:latitude>?</loc:latitude>
               <!--Optional:-->
               <loc:geoJson>?</loc:geoJson>
            </loc:Localizacao>
            <tip:tipoUnidade>
               <tip:codigo>?</tip:codigo>
               <tip:descricao>?</tip:descricao>
            </tip:tipoUnidade>
            <!--Optional:-->
            <pag:Paginacao>
               <pag:posicaoRegistroInicio>?</pag:posicaoRegistroInicio>
               <pag:quantidadeRegistrosPorPagina>?</pag:quantidadeRegistrosPorPagina>
               <!--Optional:-->
               <pag:quantidadeRegistros>?</pag:quantidadeRegistros>
            </pag:Paginacao>
         </fil:FiltroLocalizacaoEstabelecimentoSaude>
      </est:requestLocalizarEstabelecimentoSaude>
   </soap:Body>
</soap:Envelope>