src/RequestCoretto.xml

<soap:Envelope 
            xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
	        xmlns:est="http://servicos.saude.gov.br/cnes/v1r0/estabelecimentosaudeservice" 
	        xmlns:fil="http://servicos.saude.gov.br/wsdl/mensageria/v1r0/filtrolocalizacaoestabelecimentosaude" 
	        xmlns:loc="http://servicos.saude.gov.br/schema/cnes/v1r0/localizacao" 
	        xmlns:tip="http://servicos.saude.gov.br/schema/cnes/v1r0/tipounidade" 
	        xmlns:pag="http://servicos.saude.gov.br/wsdl/mensageria/v1r0/paginacao"     >
   <soap:Header>
   <wsse:Security 
   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken wsu:Id="Id-0001334008436683-000000002c4a1908-1"
xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsse:Username>CNES.PUBLICO</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">cnes#2015public</wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</soap:Header>
   <soap:Body>
      <est:requestLocalizarEstabelecimentoSaude>
         <fil:FiltroLocalizacaoEstabelecimentoSaude>
            <loc:Localizacao>
               <loc:longitude>-43.179916</loc:longitude>
               <loc:latitude>-22.901879</loc:latitude>
            </loc:Localizacao>
            
             <tip:tipoUnidade>
               <tip:codigo>01</tip:codigo>
               <tip:descricao>POSTO DE SAÚDE</tip:descricao>
            </tip:tipoUnidade>
            <!--Optional:-->
            <pag:Paginacao>
               <pag:posicaoRegistroInicio>1</pag:posicaoRegistroInicio>
               <pag:quantidadeRegistrosPorPagina>10</pag:quantidadeRegistrosPorPagina>
               <!--Optional:-->
               <pag:quantidadeRegistros>1</pag:quantidadeRegistros>
            </pag:Paginacao>
         </fil:FiltroLocalizacaoEstabelecimentoSaude>
      </est:requestLocalizarEstabelecimentoSaude>
   </soap:Body>
</soap:Envelope>

